app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    if @product.save
---
INSERT INTO "products" ("name", "description", "price", "available", "created_at", "updated_at") VALUES ('dd3e3', 'dasda', 12.0, 1, '2025-04-25 15:11:48.578023', '2025-04-25 15:11:48.578023') RETURNING "id"

  def update
    if @product.update(product_params)
---
UPDATE "products" SET "price" = 12.01, "updated_at" = '2025-04-25 15:12:07.182057' WHERE "products"."id" = 1

  def destroy
    @product.destroy!
---
DELETE FROM "products" WHERE "products"."id" = 2